Repository: chiralsymmetry/license-guide
Catalog: LicenseGuide/Resources/Content.*.resx
Languages: sv_se

# cc_bysa_explanation
source: The Creative Commons family of public copyright licenses has the primary goal of promoting free culture and open content. That's why they have developed several licenses with careful legal language and varying terms, to allow creators who want to contribute to choose a license that suits their needs. Licensing your work as CC BY-SA gives potential licensees — people interested in copying, using, modifying and distributing your work — the right to do so in ways that would otherwise violate copyright law. However, the permission is only valid as long as they comply with the terms of the license. First of all, the licensee has to give a reasonable attribution to you as the creator (“by”), which usually means a written or verbal statement that names you, your work, and the license that applies to the work. In addition, the licensee must license their new work under exactly the same terms as your work (“Share Alike”, SA). This forces them to also contribute to free culture and open content, but in a way that respects your personal intentions for your material. It does, however, place restrictions on what other material a licensee can use to create a combined work with your material: they must have the right to license all the content of the new work as BY-SA. Note that when you release your work under a public copyright license, the license applies only to other people. This means, for example, that those who want to use your work, but not under this license, can still negotiate a separate agreement with you. Finally, please note that the choice of license should be considered final and irreversible. An author with full rights can release his work at any time under freer terms or licenses, even retroactively (i.e. earlier creations and modified works), but should expect such a release to count as final and irreversible: an author can then release new works or modified works under a different license, but should assume that old works are always covered by their freest terms. It may therefore be better to start strictly and open up, rather than the other way around.
sv_se: Creative Commons-familjen av offentliga upphovsrättslicenser har som främsta mål att främja fri kultur och öppet innehåll. Därför har de tagit fram flera licenser med noggrann juridisk utformning och olika villkor, så att upphovspersoner som vill bidra kan välja en licens som passar deras önskemål. Om du licenserar ditt verk som CC BY-SA ger det potentiella licenstagare – alltså personer intresserade av att kopiera, använda, ändra och sprida ditt verk – rätten att göra detta på sätt som annars skulle strida mot upphovsrätten. Dock gäller endast tillståndet så länge de följer villkoren i licensen. Först och främst måste licenstagaren ge ett för mediet rimligt erkännande till dig som skapare (eng. ”Attribution”, ”by”), vilket i regel innebär ett skriftligt eller verbalt uttalande som namnger dig, ditt verk, och licensen som gäller för verket. Därtill måste licenstagaren licensera sitt nya verk under precis samma villkor som ditt verk (eng. ”Share Alike”, SA). Detta tvingar dem att också bidra till fri kultur och öppet innehåll, men på ett sätt som respekterar dina personliga avsikter för ditt material. Det innebär dock begränsningar på vilket övrigt material en licenstagare kan använda för att skapa ett kombinerat verk med ditt material: de måste ju ha rätt att licensera allt innehåll i det nya verket som BY-SA. Observera att när du släpper ditt verk under en offentlig upphovsrättslicens så gäller licensen endast andra personer. Det betyder t.ex. att de som vill använda ditt verk, men inte under denna licens, fortfarande kan förhandla med dig om ett separat avtal. Observera slutligen att valet av licens bör räknas som slutgiltigt och omöjligt att ångra. En upphovsperson med fulla rättigheter kan när som helst släppa sitt verk under friare villkor eller licenser, även retroaktivt (d.v.s. tidigare skapelser och modifierade verk), men bör räkna med att en sådan befrielse räknas som slutgiltig och omöjlig att ångra: en upphovsperson kan därefter släppa nya verk eller modiferade verk med annan licens, men bör utgå från att gamla verk alltid täcks av sina friaste villkor. Det kan därför vara bättre att börja strikt och öppna upp, än tvärtom.

# cc_bysa_notice
source: [title of work] © [year] by [your name] is licensed as CC BY-SA 4.0. To view a copy of this license, visit: https://creativecommons.org/licenses/by-sa/4.0/deed.sv
sv_se: [title of work] © [year] av [your name] licenseras som CC BY-SA 4.0. För att läsa licensens innehåll, besök: https://creativecommons.org/licenses/by-sa/4.0/deed.sv

# cc_by_explanation
source: The Creative Commons family of public copyright licenses has the primary goal of promoting free culture and open content. That's why they have developed several licenses with careful legal language and varying terms, to allow creators who want to contribute to choose a license that suits their needs. Licensing your work as CC BY gives potential licensees — people interested in copying, using, modifying and distributing your work — the right to do so in ways that would otherwise violate copyright. However, the permission is only valid as long as they give due attribution to you as the creator, which usually means a written or verbal statement that names you, your work, and the license that applies to the work. Note that when you release your work under a public copyright license, the license applies only to other people. This means, for example, that those who want to use your work, but not under this license, can still negotiate a separate agreement with you. Finally, please note that the choice of license should be considered final and irreversible. An author with full rights can release his work at any time under freer terms or licenses, even retroactively (i.e. earlier creations and modified works), but should expect such a release to count as final and irreversible: an author can then release new works or modified works under a different license, but should assume that old works are always covered by their freest terms. It may therefore be better to start strictly and open up, rather than the other way around.
sv_se: Creative Commons-familjen av offentliga upphovsrättslicenser har som främsta mål att främja fri kultur och öppet innehåll. Därför har de tagit fram flera licenser med noggrann juridisk utformning och olika villkor, så att upphovspersoner som vill bidra kan välja en licens som passar deras önskemål. Om du licenserar ditt verk som CC BY ger det potentiella licenstagare – alltså personer intresserade av att kopiera, använda, ändra och sprida ditt verk – rätten att göra detta på sätt som annars skulle strida mot upphovsrätten. Dock gäller endast tillståndet så länge de ger ett för mediet rimligt erkännande till dig som skapare (eng. ”Attribution”, ”by”), vilket i regel innebär ett skriftligt eller verbalt uttalande som namnger dig, ditt verk, och licensen som gäller för verket. Observera att när du släpper ditt verk under en offentlig upphovsrättslicens så gäller licensen endast andra personer. Det betyder t.ex. att de som vill använda ditt verk, men inte under denna licens, fortfarande kan förhandla med dig om ett separat avtal. Observera slutligen att valet av licens bör räknas som slutgiltigt och omöjligt att ångra. En upphovsperson med fulla rättigheter kan när som helst släppa sitt verk under friare villkor eller licenser, även retroaktivt (d.v.s. tidigare skapelser och modifierade verk), men bör räkna med att en sådan befrielse räknas som slutgiltig och omöjlig att ångra: en upphovsperson kan därefter släppa nya verk eller modiferade verk med annan licens, men bör utgå från att gamla verk alltid täcks av sina friaste villkor. Det kan därför vara bättre att börja strikt och öppna upp, än tvärtom.

# cc_by_notice
source: [title of work] © [year] by [your name] is licensed as CC BY 4.0. To view a copy of this license, visit: https://creativecommons.org/licenses/by/4.0/deed.sv
sv_se: [title of work] © [year] av [your name] licenseras som CC BY 4.0. För att läsa licensens innehåll, besök: https://creativecommons.org/licenses/by/4.0/deed.sv

# copyright_no
source: No, I want my work to be distributed and come to use through a public agreement, even if it carries the risk that someone I despise may use or distribute it.
sv_se: Nej, jag vill att mitt verk ska kunna spridas och komma till nytta genom ett allmänt gällande avtal, även om det innebär risken att någon som jag avskyr kan komma att använda eller sprida verket.

# copyright_question
source: You are a creator of a work — a painting, novel, film, musical composition, scientific article, software documentation, photograph, architecture, choreography, technical drawing, sculpture, podcast recording, fashion design, or anything else protected by copyright. Suppose someone you despise uses or distributes your work without first having negotiated an agreement with you. Do you want this to be illegal? (“Someone you dislike” can be a person or an organization, such as for-profit, political, military, religious, local or global. Please also imagine that they want to use your work for purposes that are legal but that you personally despise, e.g. commercially, for propaganda purposes, in war, in trade with dictatorships, etc.)
sv_se: Du är en skapare av ett verk – alltså en målning, roman, film, musikalisk komposition, vetenskaplig artikel, mjukvarudokumentation, fotografi, arkitektur, koreografi, teknisk ritning, skulptur, poddradioinspelning, modedesign, eller något annat som skyddas av upphovsrätt. Antag att någon som du avskyr använder eller sprider ditt verk utan att först ha förhandlat med dig om din tillåtelse. Vill du att detta ska vara olagligt? ("Någon som du avskyr" kan vara en person eller en organisation, t.ex. vinstdrivande, politisk, militär, religiös, lokal eller global. Föreställ dig gärna också att de vill använda ditt verk för ändamål som är lagliga men som du personligen avskyr, t.ex. kommersiellt, för propagandasyften, i krig, i handel med diktaturer, etc.)

# copyright_yes
source: Yes, I want them to be forced to negotiate with me for the right to use or distribute my work. I want to be able to decide who gets to use the work, and make decisions on a case-by-case basis.
sv_se: Ja, jag vill att de ska tvingas förhandla med mig om rätten att använda eller sprida mitt verk. Jag vill kunna bestämma över vem som får använda verket, och fatta beslut i varje enskilt fall.

# full_copyright_explanation
source: For full control, you should rely on the copyright that applies by default to all works that reach the threshold of originality. Almost all countries have signed agreements to enforce copyright laws with certain minimum protections, and to respect copyright in each other's countries. A creator of a work, such as a painting, novel, film, or musical composition, automatically has at least 50 years of exclusive economic and moral rights to determine how the work is copied and distributed, provided it is sufficiently original. Normal copyright applies even in the absence of a copyright notice, e.g. if you publish your work online without ever writing that you prohibit copying or distribution. Nevertheless, it is a good idea to be explicit to avoid misunderstandings, if only because many people are ignorant of copyright. Any individual or organization that wants to use your work legally must negotiate for your permission, usually through a written agreement. Please note that an author with full rights can offer his reserved work under freer terms or licenses at any time, even retroactively (i.e. previously created and modified work). However, such a release should be considered final and irrevocable: an author may subsequently release new or modified works under a different license, but should assume that old works are always covered by their freest terms.
sv_se: För full kontroll bör du förlita dig på upphovsrätten som gäller som standard för alla verk som uppnår verkshöjd. Nästan alla länder har ingått avtal om att upprätthålla lagar om upphovsrätt med vissa minimiskydd, och att respektera upphovsrätt i varandras länder. En skapare av ett verk, som en målning, roman, film, eller musikalisk komposition, har automatiskt minst 50 års ekonomisk och moralisk ensamrätt att bestämma över hur verket kopieras och sprids, förutsatt att det är tillräckligt originellt. Normal upphovsrätt gäller även vid avsaknad av upphovsrättsanspråk, t.ex. om man offentliggör sitt verk på nätet utan att någonsin skriva att man förbjuder kopiering eller spridning. Det är trots detta en god idé att vara uttrycklig för att slippa missförstånd, om så bara för att många är okunniga om upphovsrätt. Varje enskild person eller organisation som vill använda ditt verk lagligt måste förhandla med dig om tillåtelse, oftast genom ett skriftligt avtal. Observera att en upphovsperson med fulla rättigheter när som helst kan erbjuda sitt förbehållna verk under friare villkor eller licenser, även retroaktivt (d.v.s. tidigare skapelser och modifierade verk). Dock bör en sådan befrielse räknas som slutgiltig och omöjlig att ångra: en upphovsperson kan därefter släppa nya verk eller modiferade verk med annan licens, men bör utgå från att gamla verk alltid täcks av sina friaste villkor.

# full_copyright_notice
source: Copyright (c) [year] [your name]. All rights reserved.
sv_se: Copyright (c) [year] [your name]. Kopiering förbjuden.

# full_copyright_title
source: No License
sv_se: Ingen licens

# noncommercial_no
source: No, I want my work to be distributed and come to use, even if it carries the risk that someone I detest might use it to make money.
sv_se: Nej, jag vill att mitt verk ska kunna spridas och komma till nytta, även om det innebär risken att någon som jag avskyr kan använda det för att tjäna pengar.

# noncommercial_question
source: Suppose someone you despise uses or distributes your work commercially. Do you want this to be illegal?
sv_se: Antag att någon som du avskyr använder eller sprider ditt verk kommersiellt. Vill du att detta ska vara olagligt?

# noncommercial_yes
source: Yes, in order to use my work, I want them to be prevented from using it for profit.
sv_se: Ja, för att få använda mitt verk vill jag att de ska förhindras från att använda det i vinstdrivande syften.

# notice_label
source: Example text that can be placed in combination with the work (e.g. in a book):
sv_se: Exempel på text som kan sättas i anslutning till verket (t.ex. i en bok):

# no_derivatives_no
source: No, I want my work to be distributed and come to use, even if it carries the risk of someone I despise making changes that I despise.
sv_se: Nej, jag vill att mitt verk ska kunna spridas och komma till nytta, även om det innebär risken att någon som jag avskyr gör ändringar som jag avskyr.

# no_derivatives_question
source: Suppose someone you despise uses your work in some context. They have made their own changes to your work, e.g. cut out parts, translated language, changed color, increased pacing, used it as part of a larger work, etc. You despise the changes, possibly because you feel that it misrepresents your work, or because the changes go against your aesthetic sensibilities. Do you want this to be illegal?
sv_se: Antag att någon som du avskyr använder ditt verk i något sammanhang. De har gjort sina egna ändringar av ditt verk, t.ex. klippt bort delar, översatt språk, ändrat färg, ökat takt, använder det som del i större verk, etc. Du avskyr ändringarna, möjligtvis för att du anser att det felrepresenterar ditt verk, eller att ändringarna strider mot din estetiska känsla. Vill du att detta ska vara olagligt?

# no_derivatives_yes
source: Yes, in order to use my work, I want them to be prevented from making changes. My work should be kept intact.
sv_se: Ja, för att få använda mitt verk vill jag att de ska förhindras från att göra ändringar. Mitt verk ska hållas orört.

# share_alike_no
source: No, I want my work to be distributed and come to use, even if it carries the risk of it becoming part of a work that is "locked up" behind someone else's copyright.
sv_se: Nej, jag vill att mitt verk ska kunna spridas och komma till nytta, även om det innebär risken att det blir en del av ett verk som blir ”låst” bakom någon annans upphovsrätt.

# share_alike_question
source: Suppose someone you despise uses your work as part of their own work, or possibly uses your work directly but with modifications. They assert their full copyright in their new work, and threaten to sue anyone who uses it without permission. Do you want their use of your work to be illegal?
sv_se: Antag att någon som du avskyr använder ditt verk som en del av sitt eget verk, eller möjligtvis använder ditt verk direkt men med ändringar. De framhåller sin fulla upphovsrätt till sitt nya verk, och hotar att stämma alla som använder det utan lov. Vill du att deras användning av ditt verk ska vara olaglig?

# share_alike_yes
source: Yes, in exchange for using my work, I want them to be forced to release their own work under the same conditions.
sv_se: Ja, för att få använda mitt verk vill jag att de ska tvingas släppa sitt eget verk under samma villkor.
