Repository: chiralsymmetry/license-guide
Catalog: LicenseGuide/Resources/Content.*.resx
Languages: sv_se

# attribution_no
source: No, I want my work to be distributed and come to use, even if it means the risk of not being acknowledged as the creator of the work.
sv_se: Nej, jag vill att mitt verk ska kunna spridas och komma till nytta, även om det innebär risken att jag inte får erkännelse som verkets skapare.

# attribution_question
source: Suppose someone you despise uses or distributes your work. Nowhere do they state that you are the creator of the work. Do you want this to be illegal?
sv_se: Antag att någon som du avskyr använder eller sprider ditt verk. Ingenstans skriver de att det är du som skapat verket. Vill du att detta ska vara olagligt?

# attribution_yes
source: Yes, in exchange for using my work, I want them to be forced to acknowledge me as the creator of the work.
sv_se: Ja, för att få använda mitt verk vill jag att de ska tvingas erkänna mig som verkets skapare.

# cc0_explanation
source: The Creative Commons family of public copyright licenses has the primary goal of promoting free culture and open content. That's why they have developed several licenses with careful legal language and varying terms and conditions, to allow creators who want to contribute to choose a license that suits their needs. By licensing/marking your work as CC0, you indicate your intention to permanently waive all copyright, to the fullest extent permitted by law, without any requirement for compensation or attribution. (Please note that the license applies only to copyright, not to trademarks or patents. You also cannot waive the rights of other people; for example, you can waive the copyright of your photograph of another person, but if that person has a “right of publicity” to control his or her image, you cannot waive that right.) Please note that the choice of license should be considered final and irrevocable. An author who releases his or her work under CC0 should expect such a release to be considered final and irrevocable; the author may create new or modified works with different terms or licenses, but should assume that old works are always covered by their freest terms. On the other hand, an author who releases a work under stricter terms/licenses may release the work at any time, even retroactively (i.e. previous creations and modified works). It may therefore be better to start strictly and open up, rather than the other way around.
sv_se: Creative Commons-familjen av offentliga upphovsrättslicenser har som främsta mål att främja fri kultur och öppet innehåll. Därför har de tagit fram flera licenser med noggrann juridisk utformning och olika villkor, så att upphovspersoner som vill bidra kan välja en licens som passar deras önskemål. Om du licenserar/markerar ditt verk som CC0 visar du din avsikt att permanent avsäga dig alla upphovsrättigheter, så långt lagen tillåter, utan något som helst krav på kompensation eller tillskrivning. (Observera att tillståndet endast gäller upphovsrätt, inte varumärken eller patent. Man kan heller inte avsäga andra personers rättigheter; exempel: du kan avsäga dig upphovsrätten för ditt fotografi av en annan människa, men om den personen har ”publicitetsrätt” att bestämma över sin avbildning så kan du inte avsäga den rätten.) Observera att valet av licens bör räknas som slutgiltigt och omöjligt att ångra. En upphovsperson som släpper sitt verk under CC0 bör räkna med att en sådan befrielse räknas som slutgiltig och omöjlig att ångra; upphovspersonen kan skapa nya eller modifierade verk med andra villkor eller licenser, men bör utgå från att gamla verk alltid täcks av sina friaste villkor. Däremot kan en upphovsperson som släpper ett verk under striktare villkor/licenser när som helst släppa verket fritt, även retroaktivt (d.v.s. tidigare skapelser och modifierade verk). Det kan därför vara bättre att börja strikt och öppna upp, än tvärtom.

# cc0_notice
source: [title of work] by [your name] is licensed/marked as CC0 1.0 Universal. To view a copy of this license, visit: https://creativecommons.org/publicdomain/zero/1.0/deed.sv
sv_se: [title of work] av [your name] licenseras/markeras som CC0 1.0 Universal. För att läsa licensens innehåll, besök: https://creativecommons.org/publicdomain/zero/1.0/deed.sv

# cc_byncnd_explanation
source: The Creative Commons family of public copyright licenses has the primary goal of promoting free culture and open content. That's why they have developed several licenses with careful legal language and varying terms, to allow creators who want to contribute to choose a license that suits their needs. Licensing your work as CC BY-NC-ND gives potential licensees — people interested in copying, using and distributing your work — the right to do so in ways that would otherwise violate copyright law. However, the permission is only valid as long as they comply with the terms of the license. First and foremost, they may not use your work for “Non-Commercial” (NC) purposes, which is defined as situations where the use is “primarily intended” to make money or be of commercial benefit. This is regardless of whether the licensee itself is a for-profit organization or not. In addition, the licensee may not modify the work (“No Derivatives”, ND): it must be distributed in its entirety and in its original form. However, the licensee may change its “format” or “medium”; in the case of music, for example, the licensee may offer it in various digital downloadable formats, play it on the radio, or the like. However, the work may not be used as part of a larger work, for example as background music in a film, even if unmodified in its entirety. Finally, the licensee must give due attribution to you as the creator (“by”), which usually means a written or verbal statement that names you, your work, and the license that applies to the work. Note that when you release your work under a public copyright license, the license applies only to other people. This means, for example, that those who want to use your work, but not under this license, can still negotiate a separate agreement with you. Finally, please note that the choice of license should be considered final and irreversible. An author with full rights can release his work at any time under freer terms or licenses, even retroactively (i.e. earlier creations and modified works), but should expect such a release to count as final and irreversible: an author can then release new works or modified works under a different license, but should assume that old works are always covered by their freest terms. It may therefore be better to start strictly and open up, rather than the other way around.
sv_se: Creative Commons-familjen av offentliga upphovsrättslicenser har som främsta mål att främja fri kultur och öppet innehåll. Därför har de tagit fram flera licenser med noggrann juridisk utformning och olika villkor, så att upphovspersoner som vill bidra kan välja en licens som passar deras önskemål. Om du licenserar ditt verk som CC BY-NC-ND ger det potentiella licenstagare – alltså personer intresserade av att kopiera, använda och sprida ditt verk – rätten att göra detta på sätt som annars skulle strida mot upphovsrätten. Dock gäller endast tillståndet så länge de följer villkoren i licensen. Först och främst får de inte använda ditt verk för kommersiella syften (eng. ”Non-Commercial”, NC), vilket definieras som situationer där användningen har ”främsta avsikten” att tjäna pengar eller komma till kommersiell gagn. Detta är oberoende av huruvida licenstagaren i sig är en vinstdrivande organisation. Därtill får licenstagaren inte modifiera verket (eng. ”No Derivatives”, ND): det måste spridas i sin helhet och i sitt originalskick. Licenstagare får dock ändra dess ”format” eller ”medium”; om det är tal om musik kan licenstagaren exempelvis erbjuda den i olika digitala nedladdningsbara format, spela den på radio, eller liknande. Verket får dock inte användas som del i ett större verk, t.ex. som bakgrundsmusik i en film, även omodifierat i sin helhet. Slutligen måste licenstagaren ge ett för mediet rimligt erkännande till dig som skapare (eng. ”Attribution”, ”by”), vilket i regel innebär ett skriftligt eller verbalt uttalande som namnger dig, ditt verk, och licensen som gäller för verket. Observera att när du släpper ditt verk under en offentlig upphovsrättslicens så gäller licensen endast andra personer. Det betyder t.ex. att de som vill använda ditt verk, men inte under denna licens, fortfarande kan förhandla med dig om ett separat avtal. Observera slutligen att valet av licens bör räknas som slutgiltigt och omöjligt att ångra. En upphovsperson med fulla rättigheter kan när som helst släppa sitt verk under friare villkor eller licenser, även retroaktivt (d.v.s. tidigare skapelser och modifierade verk), men bör räkna med att en sådan befrielse räknas som slutgiltig och omöjlig att ångra: en upphovsperson kan därefter släppa nya verk eller modiferade verk med annan licens, men bör utgå från att gamla verk alltid täcks av sina friaste villkor. Det kan därför vara bättre att börja strikt och öppna upp, än tvärtom.

# cc_byncnd_notice
source: [title of work] © [year] by [your name] is licensed as CC BY-NC-ND 4.0. To view a copy of this license, visit: https://creativecommons.org/licenses/by-nc-nd/4.0/deed.sv
sv_se: [title of work] © [year] av [your name] licenseras som CC BY-NC-ND 4.0. För att läsa licensens innehåll, besök: https://creativecommons.org/licenses/by-nc-nd/4.0/deed.sv

# cc_byncsa_explanation
source: The Creative Commons family of public copyright licenses has the primary goal of promoting free culture and open content. That's why they have developed several licenses with careful legal language and varying terms, to allow creators who want to contribute to choose a license that suits their needs. Licensing your work as CC BY-NC-SA gives potential licensees — people interested in copying, using, modifying and distributing your work — the right to do so in ways that would otherwise violate copyright law. However, the permission is only valid as long as they comply with the terms of the license. First and foremost, they may not use your work for “Non-Commercial” (NC) purposes, which is defined as situations where the use is “primarily intended” to make money or be of commercial benefit. This is regardless of whether the licensee itself is a for-profit organization or not. In addition, the licensee must give due attribution to you as the creator (“by”), which usually means a written or verbal statement that names you, your work, and the license that applies to the work. Finally, the licensee must license their new work under exactly the same terms as your work (“Share Alike”, SA). This forces them to also contribute to free culture and open content, but in a way that respects your personal intentions for your material. It does, however, place restrictions on what other material a licensee can use to create a combined work with your material: they must have the right to license all the content of the new work as BY-NC-SA. Note that when you release your work under a public copyright license, the license applies only to other people. This means, for example, that those who want to use your work, but not under this license, can still negotiate a separate agreement with you. Finally, please note that the choice of license should be considered final and irreversible. An author with full rights can release his work at any time under freer terms or licenses, even retroactively (i.e. earlier creations and modified works), but should expect such a release to count as final and irreversible: an author can then release new works or modified works under a different license, but should assume that old works are always covered by their freest terms. It may therefore be better to start strictly and open up, rather than the other way around.
sv_se: Creative Commons-familjen av offentliga upphovsrättslicenser har som främsta mål att främja fri kultur och öppet innehåll. Därför har de tagit fram flera licenser med noggrann juridisk utformning och olika villkor, så att upphovspersoner som vill bidra kan välja en licens som passar deras önskemål. Om du licenserar ditt verk som CC BY-NC-SA ger det potentiella licenstagare – alltså personer intresserade av att kopiera, använda, ändra och sprida ditt verk – rätten att göra detta på sätt som annars skulle strida mot upphovsrätten. Dock gäller endast tillståndet så länge de följer villkoren i licensen. Först och främst får de inte använda ditt verk för kommersiella syften (eng. ”Non-Commercial”, NC), vilket definieras som situationer där användningen har ”främsta avsikten” att tjäna pengar eller komma till kommersiell gagn. Detta är oberoende av huruvida licenstagaren i sig är en vinstdrivande organisation. Därtill måste licenstagaren ge ett för mediet rimligt erkännande till dig som skapare (eng. ”Attribution”, ”by”), vilket i regel innebär ett skriftligt eller verbalt uttalande som namnger dig, ditt verk, och licensen som gäller för verket. Slutligen måste licenstagaren licensera sitt nya verk under precis samma villkor som ditt verk (eng. ”Share Alike”, SA). Detta tvingar dem att också bidra till fri kultur och öppet innehåll, men på ett sätt som respekterar dina personliga avsikter för ditt material. Det innebär dock begränsningar på vilket övrigt material en licenstagare kan använda för att skapa ett kombinerat verk med ditt material: de måste ju ha rätt att licensera allt innehåll i det nya verket som BY-NC-SA. Observera att när du släpper ditt verk under en offentlig upphovsrättslicens så gäller licensen endast andra personer. Det betyder t.ex. att de som vill använda ditt verk, men inte under denna licens, fortfarande kan förhandla med dig om ett separat avtal. Observera slutligen att valet av licens bör räknas som slutgiltigt och omöjligt att ångra. En upphovsperson med fulla rättigheter kan när som helst släppa sitt verk under friare villkor eller licenser, även retroaktivt (d.v.s. tidigare skapelser och modifierade verk), men bör räkna med att en sådan befrielse räknas som slutgiltig och omöjlig att ångra: en upphovsperson kan därefter släppa nya verk eller modiferade verk med annan licens, men bör utgå från att gamla verk alltid täcks av sina friaste villkor. Det kan därför vara bättre att börja strikt och öppna upp, än tvärtom.

# cc_byncsa_notice
source: [title of work] © [year] by [your name] is licensed as CC BY-NC-SA 4.0. To view a copy of this license, visit: https://creativecommons.org/licenses/by-nc-sa/4.0/deed.sv
sv_se: [title of work] © [year] av [your name] licenseras som CC BY-NC-SA 4.0. För att läsa licensens innehåll, besök: https://creativecommons.org/licenses/by-nc-sa/4.0/deed.sv

# cc_bync_explanation
source: The Creative Commons family of public copyright licenses has the primary goal of promoting free culture and open content. That's why they have developed several licenses with careful legal language and varying terms, to allow creators who want to contribute to choose a license that suits their needs. Licensing your work as CC BY-NC gives potential licensees — people interested in copying, using, modifying and distributing your work — the right to do so in ways that would otherwise violate copyright law. However, the permission is only valid as long as they comply with the terms of the license. First and foremost, they may not use your work for “Non-Commercial” (NC) purposes, which is defined as situations where the use is “primarily intended” to make money or be of commercial benefit. This is regardless of whether the licensee itself is a for-profit organization or not. In addition, the licensee must give due attribution to you as the creator (“by”), which usually means a written or verbal statement that names you, your work, and the license that applies to the work. Note that when you release your work under a public copyright license, the license applies only to other people. This means, for example, that those who want to use your work, but not under this license, can still negotiate a separate agreement with you. Finally, please note that the choice of license should be considered final and irreversible. An author with full rights can release his work at any time under freer terms or licenses, even retroactively (i.e. earlier creations and modified works), but should expect such a release to count as final and irreversible: an author can then release new works or modified works under a different license, but should assume that old works are always covered by their freest terms. It may therefore be better to start strictly and open up, rather than the other way around.
sv_se: Creative Commons-familjen av offentliga upphovsrättslicenser har som främsta mål att främja fri kultur och öppet innehåll. Därför har de tagit fram flera licenser med noggrann juridisk utformning och olika villkor, så att upphovspersoner som vill bidra kan välja en licens som passar deras önskemål. Om du licenserar ditt verk som CC BY-NC ger det potentiella licenstagare – alltså personer intresserade av att kopiera, använda, ändra och sprida ditt verk – rätten att göra detta på sätt som annars skulle strida mot upphovsrätten. Dock gäller endast tillståndet så länge de följer villkoren i licensen. Först och främst får de inte använda ditt verk för kommersiella syften (eng. ”Non-Commercial”, NC), vilket definieras som situationer där användningen har ”främsta avsikten” att tjäna pengar eller komma till kommersiell gagn. Detta är oberoende av huruvida licenstagaren i sig är en vinstdrivande organisation. Därtill måste licenstagaren ge ett för mediet rimligt erkännande till dig som skapare (eng. ”Attribution”, ”by”), vilket i regel innebär ett skriftligt eller verbalt uttalande som namnger dig, ditt verk, och licensen som gäller för verket. Observera att när du släpper ditt verk under en offentlig upphovsrättslicens så gäller licensen endast andra personer. Det betyder t.ex. att de som vill använda ditt verk, men inte under denna licens, fortfarande kan förhandla med dig om ett separat avtal. Observera slutligen att valet av licens bör räknas som slutgiltigt och omöjligt att ångra. En upphovsperson med fulla rättigheter kan när som helst släppa sitt verk under friare villkor eller licenser, även retroaktivt (d.v.s. tidigare skapelser och modifierade verk), men bör räkna med att en sådan befrielse räknas som slutgiltig och omöjlig att ångra: en upphovsperson kan därefter släppa nya verk eller modiferade verk med annan licens, men bör utgå från att gamla verk alltid täcks av sina friaste villkor. Det kan därför vara bättre att börja strikt och öppna upp, än tvärtom.

# cc_bync_notice
source: [title of work] © [year] by [your name] is licensed as CC BY-NC 4.0. To view a copy of this license, visit: https://creativecommons.org/licenses/by-nc/4.0/deed.sv
sv_se: [title of work] © [year] av [your name] licenseras som CC BY-NC 4.0. För att läsa licensens innehåll, besök: https://creativecommons.org/licenses/by-nc/4.0/deed.sv

# cc_bynd_explanation
source: The Creative Commons family of public copyright licenses has the primary goal of promoting free culture and open content. That's why they have developed several licenses with careful legal language and varying terms, to allow creators who want to contribute to choose a license that suits their needs. Licensing your work as CC BY-ND gives potential licensees — people interested in copying, using and distributing your work — the right to do so in ways that would otherwise violate copyright law. However, the permission is only valid as long as they comply with the terms of the license. First of all, the licensee may not modify the work (“No Derivatives”, ND): it must be distributed in its entirety and in its original form. However, the licensee may change its “format” or “medium”; in the case of music, for example, the licensee may offer it in various digital downloadable formats, play it on the radio, or the like. However, the work may not be used as part of a larger work, for example as background music in a film, even if unmodified in its entirety. In addition, the licensee must give due attribution to you as the creator (“by”), which usually means a written or verbal statement that names you, your work, and the license that applies to the work. Note that when you release your work under a public copyright license, the license applies only to other people. This means, for example, that those who want to use your work, but not under this license, can still negotiate a separate agreement with you. Finally, please note that the choice of license should be considered final and irreversible. An author with full rights can release his work at any time under freer terms or licenses, even retroactively (i.e. earlier creations and modified works), but should expect such a release to count as final and irreversible: an author can then release new works or modified works under a different license, but should assume that old works are always covered by their freest terms. It may therefore be better to start strictly and open up, rather than the other way around.
sv_se: Creative Commons-familjen av offentliga upphovsrättslicenser har som främsta mål att främja fri kultur och öppet innehåll. Därför har de tagit fram flera licenser med noggrann juridisk utformning och olika villkor, så att upphovspersoner som vill bidra kan välja en licens som passar deras önskemål. Om du licenserar ditt verk som CC BY-ND ger det potentiella licenstagare – alltså personer intresserade av att kopiera, använda och sprida ditt verk – rätten att göra detta på sätt som annars skulle strida mot upphovsrätten. Dock gäller endast tillståndet så länge de följer villkoren i licensen. Först och främst får licenstagaren inte modifiera verket (eng. ”No Derivatives”, ND): det måste spridas i sin helhet och i sitt originalskick. Licenstagare får dock ändra dess ”format” eller ”medium”; om det är tal om musik kan licenstagaren exempelvis erbjuda den i olika digitala nedladdningsbara format, spela den på radio, eller liknande. Verket får dock inte användas som del i ett större verk, t.ex. som bakgrundsmusik i en film, även omodifierat i sin helhet. Därtill måste licenstagaren ge ett för mediet rimligt erkännande till dig som skapare (eng. ”Attribution”, ”by”), vilket i regel innebär ett skriftligt eller verbalt uttalande som namnger dig, ditt verk, och licensen som gäller för verket. Observera att när du släpper ditt verk under en offentlig upphovsrättslicens så gäller licensen endast andra personer. Det betyder t.ex. att de som vill använda ditt verk, men inte under denna licens, fortfarande kan förhandla med dig om ett separat avtal. Observera slutligen att valet av licens bör räknas som slutgiltigt och omöjligt att ångra. En upphovsperson med fulla rättigheter kan när som helst släppa sitt verk under friare villkor eller licenser, även retroaktivt (d.v.s. tidigare skapelser och modifierade verk), men bör räkna med att en sådan befrielse räknas som slutgiltig och omöjlig att ångra: en upphovsperson kan därefter släppa nya verk eller modiferade verk med annan licens, men bör utgå från att gamla verk alltid täcks av sina friaste villkor. Det kan därför vara bättre att börja strikt och öppna upp, än tvärtom.

# cc_bynd_notice
source: [title of work] © [year] by [your name] is licensed as CC BY-ND 4.0. To view a copy of this license, visit: https://creativecommons.org/licenses/by-nd/4.0/deed.sv
sv_se: [title of work] © [year] av [your name] licenseras som CC BY-ND 4.0. För att läsa licensens innehåll, besök: https://creativecommons.org/licenses/by-nd/4.0/deed.sv
