Repository: chiralsymmetry/license-guide
Catalog: LicenseGuide/Resources/Font.*.resx
Languages: sv_se

# attribution_no
source: No, I want my font to be shared and come to use, even if it carries the risk that I won’t be acknowledged as the font’s creator.
sv_se: Nej, jag vill att min fontfil ska kunna spridas och komma till nytta, även om det innebär risken att jag inte får erkännelse som fontfilens skapare.

# attribution_question
source: Suppose someone you despise distributes your font. Nowhere do they state that you are the creator of the font. Do you want this to be illegal?
sv_se: Antag att någon som du avskyr sprider din fontfil. Ingenstans skriver de att det är du som skapat fontfilen. Vill du att detta ska vara olagligt?

# attribution_yes
source: Yes, they can use my font in printed material and the like without mentioning my name, but in order to distribute my font, I want them to be forced to acknowledge me as the font’s creator.
sv_se: Ja, de kan få använda min font i tryckmaterial och liknande utan att ange mitt namn, men för att få sprida min fontfil vill jag att de ska tvingas erkänna mig som fontfilens skapare.

# cc0_explanation
source: The Creative Commons family of public copyright licenses has the primary goal of promoting free culture and open content. That’s why they have developed several licenses with careful legal language and varying terms and conditions, to allow creators who want to contribute to choose a license that suits their needs. By licensing/marking your font as CC0, you indicate your intention to permanently waive all copyright, to the fullest extent permitted by law, without any requirement for compensation or attribution. (Please note that the license applies only to copyright, not to trademarks or patents.) Please note that the choice of license should be considered final and irrevocable. An author who releases his or her font under CC0 should expect such a release to be considered final and irrevocable; the author may create new or modified fonts with different terms or licenses, but should assume that old fonts are always covered by their freest terms. On the other hand, an author who releases a font under stricter terms/licenses may release the font at any time, even retroactively (i.e. previously created and modified fonts). It may therefore be better to start strictly and open up, rather than the other way around.
sv_se: Creative Commons-familjen av offentliga upphovsrättslicenser har som främsta mål att främja fri kultur och öppet innehåll. Därför har de tagit fram flera licenser med noggrann juridisk utformning och olika villkor, så att upphovspersoner som vill bidra kan välja en licens som passar deras önskemål. Om du licenserar/markerar din fontfil som CC0 visar du din avsikt att permanent avsäga dig alla upphovsrättigheter, så långt lagen tillåter, utan något som helst krav på kompensation eller tillskrivning. (Observera att tillståndet endast gäller upphovsrätt, inte varumärken eller patent.) Observera att valet av licens bör räknas som slutgiltigt och omöjligt att ångra. En upphovsperson som släpper sin fontfil under CC0 bör räkna med att en sådan befrielse räknas som slutgiltig och omöjlig att ångra; upphovspersonen kan skapa nya eller modifierade fontfiler med andra villkor eller licenser, men bör utgå från att gamla fontfiler alltid täcks av sina friaste villkor. Däremot kan en upphovsperson som släpper en fontfil under striktare villkor/licenser när som helst släppa fontfilen fritt, även retroaktivt (d.v.s. tidigare skapade och modifierade fontfiler). Det kan därför vara bättre att börja strikt och öppna upp, än tvärtom.

# copyright_no
source: No, I want my font to be distributed and come to use through a public agreement, even if it means that someone I despise might use or distribute the font.
sv_se: Nej, jag vill att min fontfil ska kunna spridas och komma till nytta genom ett allmänt gällande avtal, även om det innebär risken att någon som jag avskyr kan komma att använda eller sprida fontfilen.

# copyright_question
source: Suppose someone you despise uses or distributes your font without first having negotiated an agreement with you. Do you want this to be illegal? (“Someone you despise” can be a person or an organization, e.g. for-profit, political, military, religious, local or global. Please also imagine that they want to use your font for purposes that are legal but that you personally despise, e.g. commercially, for propaganda purposes, in war, in trade with dictatorships, etc.)
sv_se: Antag att någon som du avskyr använder eller sprider din fontfil utan att först ha förhandlat med dig om din tillåtelse. Vill du att detta ska vara olagligt? (”Någon som du avskyr” kan vara en person eller en organisation, t.ex. vinstdrivande, politisk, militär, religiös, lokal eller global. Föreställ dig gärna också att de vill använda din fontfil för ändamål som är lagliga men som du personligen avskyr, t.ex. kommersiellt, för propagandasyften, i krig, i handel med diktaturer, etc.)

# copyright_yes
source: Yes, I want them to be forced to negotiate with me for the right to use or distribute my font. I want to be able to decide who gets to use the font, and make decisions on a case-by-case basis.
sv_se: Ja, jag vill att de ska tvingas förhandla med mig om rätten att använda eller sprida min fontfil. Jag vill kunna bestämma över vem som får använda fontfilen, och fatta beslut i varje enskilt fall.

# derivative_no
source: No, I want my font to be distributed and come to use, even if it carries the risk of someone I despise making changes that I despise.
sv_se: Nej, jag vill att min fontfil ska kunna spridas och komma till nytta, även om det innebär risken att någon som jag avskyr gör ändringar som jag avskyr.

# derivative_question
source: Suppose someone you despise uses your font in some context. They have made their own changes to your font, such as changing some shapes or adding glyphs. You despise the changes, possibly because you think it misrepresents your work, or because the changes go against your sense of aesthetics. Do you want this to be illegal?
sv_se: Antag att någon som du avskyr använder din fontfil i något sammanhang. De har gjort sina egna ändringar av din fontfil, t.ex. ändrat några former eller lagt till glyfer. Du avskyr ändringarna, möjligtvis för att du anser att det felrepresenterar ditt verk, eller att ändringarna strider mot din estetiska känsla. Vill du att detta ska vara olagligt?

# derivative_yes
source: Yes, in order to use my font, I want them to be prevented from making changes. My font should be kept untouched.
sv_se: Ja, för att få använda min fontfil vill jag att de ska förhindras från att göra ändringar. Min fontfil ska hållas orörd.

# full_copyright_explanation
source: For full control, you should rely on the copyright that applies by default to all works that reach the threshold of originality. Almost all countries have signed agreements to enforce copyright laws with certain minimum protections, and to respect copyright in each other’s countries. A creator of a work, such as a font, automatically has at least 50 years of exclusive economic and moral rights to determine how the work is copied and distributed, provided it is sufficiently original. Normal copyright applies even in the absence of a copyright notice, e.g. if you publish your font online without ever writing that you prohibit its use, copying or distribution. Nevertheless, it is a good idea to be explicit to avoid misunderstandings, if only because fonts are often freely available online. Any individual or organization that wants to use your font legally must negotiate for your permission, usually through a written agreement. Please note that an author with full rights can offer his reserved font under freer terms or licenses at any time, even retroactively (i.e. previously created and modified fonts). However, such a release should be considered final and irrevocable: an author may subsequently release new or modified fonts under a different license, but should assume that old fonts are always covered by their freest terms.
sv_se: För full kontroll bör du förlita dig på upphovsrätten som gäller som standard för alla verk som uppnår verkshöjd. Nästan alla länder har ingått avtal om att upprätthålla lagar om upphovsrätt med vissa minimiskydd, och att respektera upphovsrätt i varandras länder. En skapare av ett verk, som en fontfil, har automatiskt minst 50 års ekonomisk och moralisk ensamrätt att bestämma över hur verket kopieras och sprids, förutsatt att det är tillräckligt originellt. Normal upphovsrätt gäller även vid avsaknad av upphovsrättsanspråk, t.ex. om man offentliggör sin fontfil på nätet utan att någonsin skriva att man förbjuder användning, kopiering eller spridning. Det är trots detta en god idé att vara uttrycklig för att slippa missförstånd, om så bara för att fontfiler ofta erbjuds fritt på nätet. Varje enskild person eller organisation som vill använda din fontfil lagligt måste förhandla med dig om tillåtelse, oftast genom ett skriftligt avtal. Observera att en upphovsperson med fulla rättigheter när som helst kan erbjuda sin förbehållna fontfil under friare villkor eller licenser, även retroaktivt (d.v.s. tidigare skapelser och modifierade fontfiler). Dock bör en sådan befrielse räknas som slutgiltig och omöjlig att ångra: en upphovsperson kan därefter släppa nya eller modiferade fontfiler med annan licens, men bör utgå från att gamla fontfiler alltid täcks av sina friaste villkor.

# full_copyright_title
source: No License
sv_se: Ingen licens

# license_label
source: Example text to put in a LICENSE or COPYRIGHT file or the like:
sv_se: Exempel på text som kan sättas i en LICENSE- eller COPYRIGHT-fil el.dyl.:

# ofl_explanation
source: The Open Font License, or OFL, is a font license created by the language research organization SIL, intended to be ideologically compatible with the GPL license of the software world: the user of an OFL-licensed font shall have the right to use the font for any purpose and to modify the font as needed, but if modified must distribute the font with improvements under the same license (OFL 1.1). The box below gives the full text of the OFL, but see the “Using the OFL” section of the https://scripts.sil.org/ofl website for more precise guidelines on how the license should be indicated. If the OFL is inappropriate, you can use the license guide for other material and choose a Creative Commons license. Note, however, that a “No Derivatives” license (i.e. a prohibition on creating works based on your work) may be inappropriate if the intent is only to prohibit modification of font files, as it could also prohibit normal use of fonts.
sv_se: Open Font License, eller OFL, är en fontlicens skapad av språkforskarorganisationen SIL, tänkt att vara ideologiskt kompatibel med mjukvaruvärldens GPL-licens: användaren av en OFL-licenserad fontfil ska ha rätt att använda fontfilen till vilket syfte som helst och att modifiera fontfilen enligt behov, men måste vid ändringar distribuera fontfilen med dess ändringar under samma licens (OFL 1.1). I rutan nedanför ges den fulla texten till OFL, men se avsnittet ”Using the OFL” på webbsidan https://scripts.sil.org/ofl för mer exakta riktlinjer för hur licensen bör anges. Om OFL är olämplig kan du använda licensguiden för övrigt material och välja en Creative Commons-licens. Observera dock att det kan vara opassande med en ”No Derivatives”-licens (d.v.s. förbud mot att skapa verk som bygger på ditt verk) om avsikten bara är att förbjuda modifiering av fontfiler, eftersom det möjligtvis också skulle kunna förbjuda normal användning av fontfilen.

# use_only_explanation
source: If you want to allow free distribution and use — i.e. things like using the font in printed material — and distribution, but prohibit modification, the only option in the absence of suitable ready-made licenses may be a custom-written license, even though it may be difficult to express the terms in a way that both legally secures your intentions, and is sufficiently easy for users to understand. Below is a proposal intended to allow private and commercial use and distribution, but prohibit modification. Note that an author with full rights may release his font at any time under freer terms or licenses, even retroactively (i.e. previously created and modified fonts), but should expect such a release to be considered final and irrevocable: an author may subsequently release new or modified fonts under a different license, but should assume that old fonts are always covered by their freest terms. It may therefore be better to start strictly and open up, rather than the other way around.
sv_se: Om man vill tillåta fri användning – alltså sådant som att använda fonten för tryckmaterial – och spridning, men förbjuda ändring, kan det enda alternativet i brist på lämpliga färdiga licenser vara en specialskriven licens, trots att det kan vara svårt att uttrycka sig på ett sätt som både säkrar juridiskt ens avsikter, och är tillräckligt lättbegripligt för användare. Nedanför ges ett förslag tänkt att tillåta privat och kommersiell användning och spridning, men förbjuda modifiering. Observera att en upphovsperson med fulla rättigheter när som helst kan släppa sin fontfil under friare villkor eller licenser, även retroaktivt (d.v.s. tidigare skapade och modifierade fontfiler), men bör räkna med att en sådan befrielse räknas som slutgiltig och omöjlig att ångra: en upphovsperson kan därefter släppa nya eller modiferade fontfiler med annan licens, men bör utgå från att gamla fontfiler alltid täcks av sina friaste villkor. Det kan därför vara bättre att börja strikt och öppna upp, än tvärtom.

# use_only_title
source: Custom-Written License
sv_se: Specialskriven licens
