Repository: chiralsymmetry/license-guide
Catalog: LicenseGuide/Resources/QAndA.*.resx
Languages: sv_se

# code_custom_license_answer
source: No, that’s usually a bad idea. If your goal is to place specific restrictions on what others can do with your code, you should be aware that it is difficult to be unambiguous; if you write something wrong, you may inadvertently introduce a loophole that allows code-receiving developers to do something you explicitly meant to forbid (or to refrain from doing something you explicitly meant to force them to do). And if your goal is to make things easier for other developers who want use your code, a custom license might make the code less secure for them, since your license is untested and uncertain. Software licenses are written with a lot of effort by people with legal expertise for a reason.
sv_se: Nej, i regel är det en dålig idé. Om ditt mål är att sätta specifika begränsningar på vad andra ska få göra med din kod så bör du vara medveten om att det är svårt att uttrycka sig på ett vattentätt sätt; om du skriver något felaktigt så kanske du råkar införa ett kryphål, så att kodlånande utvecklare kan göra något som du uttryckligen ville förbjuda (eller låta bli att göra något som du uttryckligen ville tvinga dem att göra). Och om ditt mål är att förenkla för andra potentiella kodlånande utvecklare så kan en specialskriven licens tvärtom göra koden osäkrare för dem, eftersom licensen är obeprövad. Det är inte utan anledning som mjukvarulicenser skrivs med mycket möda av folk med juridisk expertis.

# code_custom_license_question
source: No license does exactly what I want. Can’t I just write my own license?
sv_se: Ingen licens gör exakt vad jag vill. Kan jag inte bara skriva en egen licens?

# code_derivative_works_limit_answer
source: This is a contentious issue that arises particularly in the context of GPL-style licenses that require the derivative work to be licensed under the same license as the original work. Pretty much everyone agrees that if you take someone else’s source code and make a few small changes, you are creating a derivative work, and that if in a project you write almost all of the source code yourself but copy and paste someone else’s function (e.g., for some special mathematical calculation), you are also creating a derivative work. Opinions begin to diverge on the question of creating source code that merely assumes the presence of someone else’s source code without actually including it — essentially a question of whether or not derivative works are created when using libraries. The Free Software Foundation (FSF), creators of the GPL, are very strict: they believe that if your source code cannot work without a particular GPL library, you must license your own source code as GPL (if you intend to distribute it), even if your source code merely contains references to the GPL code. This could be compared to writing a sequel to someone else’s novel: you are creating a derivative work that cannot stand on its own. However, their analysis is eased somewhat if an unmodified client program works just as well with alternative libraries that are not GPL-licensed. As for compiled source code, most people agree that if the binaries of the client program contain the binary form of the library, and the client program actually uses the library’s functionality, then it’s a derivative work. If the client program and the library are separate binaries, but the client program loads the library into its own address space and uses its functionality directly, then the client program is also often considered to be a derivative work. With both separate binaries and separate address spaces, where the client program must communicate with the library through its public interface, opinions again begin to differ; as for the FSF, they consider this situation to create a clearly derivative work, and therefore offer the LGPL license to library developers who wish to allow this situation. The more independent the communication between the client program and the GPL code (as a standalone program), the less likely it is that even the FSF would consider the client program a derivative work. Many of these lines and arguments are not legally tested, but a good rule of thumb is to follow the FSF’s approach. If you don’t want to license your code under the GPL, you need to find an alternative to using someone else’s GPL-licensed code.
sv_se: Detta är en omtvistad fråga som särskilt kommer upp i anslutning till licenser i stil med GPL som kräver att det bearbetade verket måste ha samma licens som originalverket. I stort sett alla är överens om att om du tar någon annans källkod och gör några små ändringar så skapar du ett bearbetat verk, och att om du i ett projekt skriver nästan all källkod själv men kopierar in någon annans funktion (t.ex. för någon specifik matematisk beräkning), så skapar du också ett bearbetat verk. Uppfattningarna börjar skilja sig när det gäller frågan om att skapa källkod som endast förutsätter närvaron av någon annans källkod, utan att faktiskt inkludera den – i huvudsak en fråga om huruvida användning av bibliotek skapar bearbetningar. Free Software Foundation (FSF), skaparna av GPL-licensen, är väldigt strikta: de anser att om din källkod inte kan fungera utan något visst GPL-bibliotek så måste du licensera din egen källkod som GPL (om du tänkt sprida den), även om din källkod inte mer än inkluderar referenser till GPL-koden. Detta skulle kunna jämföras med att skriva en uppföljare till någon annans roman: man skapar ett bearbetat verk som inte kan stå på egna ben. Dock lättar deras analys något om ett omodifierat klientprogram fungerar även med alternativa bibliotek som inte är GPL-licenserade. Vad gäller kompilerad källkod brukar de flesta vara överens att om klientprogrammets binärer innehåller bibliotekets binärform, och klientprogrammet faktiskt använder biblioteksfunktionaliteten, så är det ett bearbetat verk. Om klientprogrammet och biblioteket är separata binärer, men klientprogrammet laddar in biblioteket i sin egen adressrymd och använder dess funktionalitet direkt, så anses det också ofta att klientprogrammet är ett bearbetat verk. Med både separata binärer och separata adressrymder, där klientprogrammet måste kommunicera med biblioteket genom dess offentliga gränssnitt, börjar åsikterna gå isär; FSF själva anser att det är tydlig bearbetning och erbjuder därför LGPL-licensen åt biblioteksutvecklare som vill tillåta denna situation. Ju mer självständig kommunikation mellan klientprogrammet och GPL-koden (som självstående program), desto mindre sannolikt är det att att ens FSF skulle anse klientprogrammet som ett bearbetat verk. Många av dessa gränsdragningar och argument är inte rättsligt beprövade, men en god tumregel är att gå på FSF:s linje. Vill du inte licensera din kod som GPL får du hitta ett alternativ till att använda någon annans GPL-licenserade kod.

# code_derivative_works_limit_question
source: Where is the line drawn for derivative works within source code/software? Will my source code have to be licensed as GPL?
sv_se: Var går gränsen för bearbetningar inom källkod/mjukvara? Måste min källkod licenseras som GPL?

# code_gpl_mixing_answer
source: Combining source code means creating a derivative work. To create or distribute a derivative work, you must have permission from the creators. If the permission comes conditionally through a license, you must comply with all the terms of the license in order to create or distribute the combination. The GPL allows free modification for personal use, i.e. you may modify code and use it privately; the code modifications create a derivative work consisting of GPL-licensed code and “proprietary” code under public copyright. Similarly, you may privately and legally combine someone else’s GPL-licensed source code with someone else’s GPL-incompatibly licensed source code. However, in order to be granted permission to distribute the combined work, the GPL requires that the derivative work be covered by the same license (i.e., the GPL), which in practice means that the derivative work must be covered by the GPL in combination with all other licenses covering the original component works: you generally do not have the right to remove the license on someone else’s work, so they all apply at the same time, albeit possibly on different parts. If any other component license imposes any restriction on what is guaranteed by the GPL, the use or distribution is no longer granted by the GPL, making the work both created and distributed in violation of copyright. It is therefore important to use GPL-compatible licenses when creating source code that uses GPL-licensed source code.
sv_se: Att kombinera källkod innebär att skapa ett bearbetat verk. För att få skapa eller sprida ett bearbetat verk måste man ha upphovspersonernas tillåtelse. Om tillåtelsen kommer villkorligt genom en licens måste man uppfylla alla ingående licensvillkor för att få skapa eller sprida kombinationen. GPL tillåter fri bearbetning för eget bruk, d.v.s. man får modifiera kod och använda privat; kodändringarna skapar ett bearbetat verk som består av GPL-licenserad kod och ”proprietär” kod under allmän upphovsrätt. På samma sätt kan man privat och lagligt kombinera någon annans GPL-licenserade källkod med någon annans GPL-inkompatibelt licenserade källkod. För tillåtelse att sprida det kombinerade verket så kräver dock GPL att bearbetningen täcks av samma licens (GPL), vilket i praktiken innebär att bearbetningen måste täckas av GPL i kombination med alla andra ingående licenser – man har i regel inte rätt att ta bort licensen för någon annans verk, så alla gäller samtidigt. Om någon annan ingående licens påför någon som helst begränsning på vad som garanteras av GPL, så beviljas inte längre användningen eller spridningen, vilket gör att det bearbetade verket både skapats och sprids i strid med upphovsrätten. Därför är det viktigt att använda GPL-kompatibla licenser när man skapar källkod som använder GPL-licenserad källkod.

# code_gpl_mixing_question
source: What happens if I combine GPL code with code under a different license?
sv_se: Vad händer om jag blandar GPL-kod med kod under annan licens?

# code_gpl_output_answer
source: No, copyright generally does not apply to output, just as Microsoft does not own the text document you create in Microsoft Word. An exception, of course, is when the output must be considered a derivative work, such as a GPL-licensed program that prints its own source code. A recording of a play session of a computer game with GPL-licensed graphical resources would also reasonably be a GPL-licensed derivative work. The guiding principle is that the output is protected by the same copyright as the input. If the input is your imagination, you fully own the output, but if, for example, you edit someone else’s photograph in a GPL-licensed photo editing software, you create a derivative work that is protected by both your copyright and the original photographer’s copyright, but not by the GPL.
sv_se: Nej, upphovsrätt gäller i regel inte för utdata, på samma sätt som Microsoft inte äger textdokumentet du skapar i Microsoft Word. Ett undantag är förstås om utdatan måste anses som ett bearbetat verk, t.ex. ett GPL-licenserat program som skriver ut sin egen källkod. En inspelning av en spelsession av ett dataspel med GPL-licenserade grafiska resurser blir också rimligtvis en GPL-licenserad bearbetning. Den vägledande regeln är att utdata skyddas av samma upphovsrätt som indatan. Om indatan är din fantasi så äger du till fullo utdatan, men om du t.ex. redigerar någon annans fotografi i ett GPL-licenserat bildbehandlingsprogram så skapar du ett bearbetat verk som täcks av både din upphovsrätt och originalfotografens upphovsrätt, men inte av GPL.

# code_gpl_output_question
source: Does the GPL license extend to the output of a program?
sv_se: Sprids GPL-licensen även till utdatan ur ett program?

# code_license_compatibility_answer
source: A license contains conditions that must be met if use is to be granted. Two licenses are incompatible if their terms cannot be complied with at the same time, e.g. if one license prohibits commercial use while the other license prohibits non-commercial use: there is no conceivable situation in which software under such a license combination can be used by a licensee. Another form of incompatibility concerns the fact that licenses may also provide legal guarantees: one license may provide guarantees that are prohibited by another license, e.g. if one license explicitly allows (but does not require) commercial use while the other license explicitly prohibits commercial use; note that the terms of both licenses can be satisfied by non-commercial use. The Free Software Foundation, creator of the GPL, considers a license to be incompatible with the GPL if either case applies, i.e. if the terms are mutually incompatible or if the other license imposes conditions that contradict guarantees provided by the GPL. However, the terms of the GPL also include that a licensee may not impose restrictions contrary to the guarantees of the GPL, which in principle converts the latter form of incompatibility into the former: use is no longer granted to anyone who attempts to circumvent the guarantees of the GPL. Therefore, it is copyright infringement to distribute GPL-licensed source code combined with source code under a GPL-incompatible license. Note that it is still permissible to create such a combination for private use. Note also that the original author of any particular source code has the legal freedom to license his work in such a way that makes the combined terms impossible for a licensee to comply with.
sv_se: En licens innehåller villkor som måste efterlevas om användning ska beviljas. Två licenser är inkompatibla om deras villkor inte kan efterlevas samtidigt, t.ex. om en licens förbjuder kommersiell användning medan den andra licensen förbjuder icke-kommersiell användning: det finns ingen tänkbar situation där mjukvara under en sådan licenskombination kan användas av en licenstagare. En annan form av inkompatibilitet berör att licenser också kan erbjuda juridiska garantier: en licens kan ge garantier som förbjuds av en annan licens, t.ex. om en licens uttryckligen tillåter (men inte kräver) kommersiell användning medan den andra licensen uttryckligen förbjuder kommersiell användning; observera att båda licensernas villkor kan efterlevas förutsatt icke-kommersiell användning. Free Software Foundation, skaparna av GPL-licensen, räknar en licens som inkompatibel med GPL om endera fallet gäller, d.v.s. om villkoren är ömsesidigt inkompatibla eller om den andra licensen sätter villkor som strider emot garantier som ges av GPL. Till villkoren i GPL hör dock också att en licenstagare inte får påföra restriktioner som strider mot garantierna i GPL, vilket i princip omvandlar den senare formen av inkompatibilitet till den första formen: användning beviljas inte längre för den som försöker ta ifrån garantierna i GPL. Därför strider det mot upphovsrätten att sprida GPL-licenserad källkod som kombinerats med källkod under GPL-inkompatibel licens; att skapa en sådan kombination för privat bruk är dock tillåtet. Den ursprungliga upphovspersonen till någon viss källkod har dock juridisk frihet att licensera sitt verk sådant att de kombinerade villkoren blir omöjliga för en licenstagare att uppfylla.

# code_license_compatibility_question
source: What is license compatibility? What is GPL compatibility?
sv_se: Vad är licenskompatibilitet? Vad är GPL-kompatibilitet?

# code_multiple_licenses_answer
source: Creators with full rights to a work can offer their work to other people not only under a single license to use the work, but also a choice: “You may use my work under license A, or B, or C”. This means that it is up to the user to choose which terms are most appropriate. The creators can also use the word “and” instead of “or”, as in “you may use my source code under license A, and B, and C”. This means that all conditions of all licenses together must be met for the use to be legal. Of course, this can quickly get tricky, and it is possible that the conditions cannot all be met at the same time — see the question about license compatibility. Conflicting conditions are not a problem for the original author, but they make it impossible for anyone else to use the source code legally.
sv_se: En upphovsperson med fulla rättigheter till ett verk kan åt andra personer erbjuda inte bara en licens för att använda verket, utan också ett val: ”du kan få använda min källkod givet licens A, eller B, eller C”. Det betyder att det är upp till användaren att välja vilka villkor som passar bäst. Upphovspersonen kan också använda ordet ”och” i stället för ”eller”, som i ”du kan få använda min källkod givet licens A, och B, och C”. Det innebär att alla villkor från alla licenser tillsammans måste uppfyllas för att användningen ska vara laglig. Detta kan förstås fort bli snårigt, och det är möjligt att villkoren är omöjliga att uppfylla samtidigt – se frågan om licenskompatibilitet. Motstridiga villkor är inte ett problem för originalets upphovsperson, men det gör det omöjligt för någon annan att lagligt använda källkoden.

# code_multiple_licenses_question
source: How does offering your source code under multiple licenses work?
sv_se: Hur fungerar det att erbjuda sin källkod under flera licenser?

# code_noncode_mix_answer
source: There is no major difference from mixing source code under different licenses: licensees must comply with all terms at the same time. Unlicensed source code may be mixed with material that does not explicitly prohibit the use of closed code, such as any Creative Commons license. The same is true for source code under a permissive license, such as “BSD+Patent”. However, complications may arise when any part is under a “copyleft” license, such as the GPL: if a GPL-licensed work is used together with a GPL-incompatible work to create a derivative work, the derivative work cannot be legally distributed under the licenses alone (i.e., without the express permission of the authors of the GPL-licensed work). This means that if you create a computer game — creating the source code and other resources from scratch — and license the source code as GPL and the rest as CC BY-NC-ND 4.0 (prohibiting derivative works and commercial use), no licensee will be able to modify and distribute the source code as long as it relies on GPL-incompatible resources. The licensee would have to replace the resources, or modify the source code so that the game somehow works without them. The reverse is also true: if the source code is GPL-incompatible and some (or all) of the resources are GPL-licensed, a licensee who wants to create and distribute a derivative work would have to either replace all the GPL-licensed resources, or replace all the GPL-incompatible resources, including the source code. Therefore, when creating or using GPL-licensed source code or resources, you should be aware of their GPL-compatibility.
sv_se: Det är ingen större skillnad från situationen där man blandar källkod under en licens med källkod under en annan licens: licenstagare måste efterleva alla villkor samtidigt. Olicenserad källkod får blandas med material som inte uttryckligen förbjuder användning av sluten kod, t.ex. alla Creative Commons-licenser. Samma gäller om källkoden är under en tillåtande licens, som ”BSD+Patent”. Komplikationer kan däremot uppstå när någon del är under en ”copyleft”-licens som GPL: om ett verk licenserat som GPL används tillsammans med ett verk licenserat under en GPL-inkompatibel licens för att skapa ett bearbetat verk, så kan inte verket lagligt spridas enbart med stöd i licenserna (d.v.s. utan uttrycklig tillåtelse från GPL-verkets upphovspersoner). Det betyder att om man skapar ett dataspel – skapar källkod och övriga resurser från grunden – och licenserar källkoden som GPL och resten som CC BY-NC-ND 4.0 (förbjuder modifiering och kommersiell användning) så kommer ingen licenstagare att kunna modifiera och sprida källkoden så länge den är beroende av GPL-inkompatibla resurser. Licenstagaren skulle behöva byta ut resurserna, eller ändra så att spelet på något sätt fungerar utan dem. Även det omvända gäller: om källkoden är GPL-inkompatibel och någon (eller alla) resurser är GPL-licenserad, så skulle en licenstagare som vill skapa och sprida ett bearbetat verk behöva antingen byta ut alla GPL-licenserade resurser eller alla GPL-inkompatibla resurser inklusive källkoden. Vid skapande eller användning av källkod eller resurser under GPL-licens bör man alltså vara medveten om deras GPL-kompatibilitet.

# code_noncode_mix_question
source: How does licensing work when source code is mixed with other types of material, such as graphical resources in a computer game?
sv_se: Hur fungerar licenser när källkod blandas med andra sorters material t.ex. grafiska resurser i ett dataspel?

# code_spdx_answer
source: The Software Package Data Exchange, or SPDX, is a standard made by the Linux Foundation for providing information on software, such as applicable licenses. It allows for tools to find legal problems when combining code. Even if you aren’t going to use such tools, it serves as an extra point of clarity for others. The format allows for situations with multiple licenses in single files: // SPDX-License-Identifier: Apache-2.0 AND GPL-3.0-only The format also allows for when the developer wants to allow choice: // SPDX-License-Identifier: Apache-2.0 OR BSD-2-Clause-Patent
sv_se: Software Package Data Exchange, or SPDX, är en standard skapad av Linux Foundation för att ge information om mjukvara, t.ex. vilka licenser som gäller. Den möjliggör för verktyg att upptäcka juridiska problem vid kombinering av kod. Även om man inte själv kommer att använda sådana verktyg ger närvaron extra klarhet i vad som gäller. Formatet kan användas även när en fil täcks av flera licenser samtidigt: // SPDX-License-Identifier: Apache-2.0 AND GPL-3.0-only Formatet kan också användas när utvecklaren vill erbjuda licensval: // SPDX-License-Identifier: Apache-2.0 OR BSD-2-Clause-Patent

# code_spdx_question
source: What is SPDX-License-Identifier?
sv_se: Vad är SPDX-License-Identifier?
