Repository: chiralsymmetry/license-guide
Catalog: LicenseGuide/Resources/QAndA.*.resx
Languages: sv_se

# code_use_gpl_without_gpl_answer
source: There are ways to legally circumvent the GPL, and copyright in general. One way is called “clean room design”, where you hire developers who have no knowledge of the original implementation, and give them only specifications of what you want them to build. In other words, the only thing the developers are allowed to know is the public API of the original. (If you didn’t have to study the original to get the specs, you might be able to legally create the work yourself.) A more GPL-specific solution if you want to use GPL libraries is to make your client program modular. You can then create a fully optional and GPL-licensed module that uses the GPL library. However, the client program must be truly independent of the GPL module. If this is not possible, you can create a rudimentary replacement for the GPL library: the client program works without the GPL library, but users who want enhanced functionality can install GPL library themselves. Depending on how the circumvention is done, it may be perceived as dishonest. No one will reasonably complain if someone independently creates software that competes with GPL software, but the more it is perceived that they are exploiting loopholes to violate the spirit of the license, the more disreputable those developers will become, and the grayer the area, the greater the risk of copyright infringement lawsuits.
sv_se: Det finns sätt att lagligt kringgå GPL-licensen, och upphovsrätt i allmänhet. Ett sätt kallas för ”renrumsdesign”, där man anlitar utvecklare utan kunskap om originalets implementation och endast ger dem specifikationer om vad man vill att de skapar. Med andra ord, det enda som utvecklarna får känna till är originalets offentliga API. (Om man inte behövt studera originalet för att få fram specifikationerna så är det möjligt att man själv kan skapa verket.) En mer GPL-specifik lösning då man vill använda GPL-bibliotek är att skapa sitt klientprogram med modularitet. Då kan man skapa en helt valfri och GPL-licenserad modul som använder GPL-biblioteket. Dock måste klientprogrammet verkligen vara helt oberoende av GPL-modulen. Om detta inte är möjligt så kan man skapa en rudimentär ersättare till GPL-biblioteket: klientprogrammet fungerar utan GPL-biblioteket, men användare som vill ha förbättrad funktionalitet kan själva sätta GPL-biblioteket på plats. Beroende på hur kringgåendet sker kan det uppfattas som oärligt. Ingen kommer rimligtvis att klaga om någon självständigt skapar mjukvara som konkurrerar med GPL-mjukvara, men ju mer det uppfattas som att de utnyttjar kryphål för att motverka licensens anda, desto mer illa ansedda kommer dessa utvecklare att bli, och ju gråare området är desto större blir risken för stämningar för brott mot upphovsrätten.

# code_use_gpl_without_gpl_question
source: Can you use GPL code without having to license your own code as GPL? Can you circumvent someone else’s license?
sv_se: Kan man använda GPL-kod utan att behöva licensera sin egen kod som GPL? Kan man kringgå någon annans licens?

# code_why_license_answer
source: In addition to the fact that software may be subject to special legal treatment in many countries, e.g. in restrictions on private copying that would be legal for other kinds of works, there may also be other complications, such as when defining “derivative work” in relation to source code: compiling source code into binary form could be considered legally the same as translating a novel from English into German, which might require explicit permission from the author. Even the simple execution of compiled code could be considered copying (from disk to physical memory), with legal implications. Given this potential complexity, a software license would preferably make it clear that the source code may be compiled and executed (if that is the intent).
sv_se: Förutom att mjukvara kan ha en särbehandling i lagen i många länder, t.ex. i begränsningar av privatkopiering som är laglig för andra sorters verk, så kan det också uppstå andra komplikationer, som med definitionen av ”bearbetning” vad gäller källkod: kompilering av källkod till binär form skulle kunna ses juridiskt på samma sätt som översättning av en roman från engelska till tyska, vilket skulle kunna kräva uttrycklig tillåtelse från upphovspersonen. Ren körning av kompilerad kod skulle också kunna räknas som kopiering (från lagringsmedium till arbetsminne), med upphovsrättsliga konsekvenser. Med tanke på denna möjliga snårighet kan det vara en stark fördel med en mjukvarulicens som tydliggör att källkoden får kompileras och köras (om det är något som man vill tillåta).

# code_why_license_question
source: Why are licenses needed specifically for software/source code (rather than using those for cultural works)?
sv_se: Varför behövs licenser specifikt för mjukvara/källkod (i stället för sådana för kulturella verk)?

# font_fonts_typefaces_answer
source: A “typeface” is an author’s design of letters, while a “font” is a specific variation of a typeface, such as bold in size 10 point. The word “font” also refers to a specific digitization of a font, i.e. a font file for use on a computer. In some countries, both typefaces and font files are protected by copyright, but many countries have decided that typefaces should not be protected by copyright (while still protecting font files). In such a country, it would be a crime to distribute someone else’s font file without permission, but it might be legal to replicate the typeface in a font file you create yourself.
sv_se: Ett ”typsnitt” är en upphovspersons utformning av bokstäver, medan en ”stil” / ”font” är en specifik variant av ett typsnitt, t.ex. fetstilt i storlek 10 punkter. Ordet ”font” avser också en specifik digitalisering av ett typsnitt/font, alltså en fontfil som kan användas på en dator. I en del länder är både typsnitt och fontfiler upphovsrättsskyddade, men många länder har bestämt att typsnitt inte ska skyddas av upphovsrätt. I ett sådant land skulle man begå ett brott om man spred någon annans fontfil utan tillstånd, men det skulle möjligtvis vara lagligt att skapa en egen fontfil med samma utseende.

# font_fonts_typefaces_question
source: What is the difference between typefaces and fonts?
sv_se: Vad är skillnaden mellan typsnitt och fonter?

# font_why_font_license_answer
source: Fonts can legally function as something between software and cultural works, as fonts are intended to be used as building blocks in other works (e.g. text on a billboard), while their design may require artistic ability. It is possible that in some countries the normal use of a typeface or font would result in something that could be considered a derivative work. This is rarely the intention of the people who create font files. For clarity and legal certainty, it may therefore be best to use a license specific to font files.
sv_se: Fonter kan juridiskt fungera som ett mellanting mellan mjukvara och kulturella verk, eftersom fonter är menade att användas som byggstenar i andra verk (t.ex. text på en reklamskylt), samtidigt som deras utformning kan kräva konstnärlig förmåga. Det är möjligt att i vissa länder skulle den normala användningen av ett typsnitt eller en font ge upphov till något som skulle kunna räknas som ett bearbetat verk. Detta är sällan avsikten hos personerna som skapar fontfiler. För tydlighet och juridisk säkerhet kan det därför vara bäst att använda en licens specifik för fontfiler.

# font_why_font_license_question
source: Why are fonts a separate category?
sv_se: Varför är fontfiler en separat kategori?

# general_anonymous_answer
source: No, copyright applies even if you publish your work under a pseudonym (an assumed name) or anonymously (no name). However, there are times when anonymous or pseudonymous publication may present a legal obstacle. For example, if you want to defend your work against copyright infringement, you must be able to prove that you are the creator of the work, and in the absence of public knowledge about whether the creator is alive or not, the copyright of the work will expire based on the year the work was published. If that’s acceptable, there’s no problem with not giving your real name or otherwise making yourself identifiable.
sv_se: Nej, upphovsrätt gäller även om man publicerar sitt verk under pseudonym (ett antaget namn) eller anonymt (inget namn). Det finns dock tillfällen då en anonym eller pseudonym publicering kan innebära ett juridiskt hinder. Om man t.ex. vill försvara sitt verk vid upphovsrättsbrott så måste man kunna styrka att man är verkets skapare, och i avsaknad av kunskap om huruvida upphovspersonen lever eller inte så kommer upphovsrätten för verket att upphöra baserat på verkets publicering. Om det är acceptabelt så är det inga problem med att inte ange sitt riktiga namn eller på annat sätt göra sig identifierbar.

# general_anonymous_question
source: Do I have to use my real name in copyright notices?
sv_se: Måste jag ange mitt riktiga namn i upphovsrättsnotiser?

# general_copyright_length_answer
source: Most countries have agreed that a work should have a minimum protection period of at least 50 years after all the creators of the work have died, which is usually referred to as “life + 50 years”. Many countries have “life + 70 years”, and some countries have “life + 120 years”. However, if the public cannot determine who the creators of the work are (i.e. if they are alive or not), the minimum term of protection is 50 years from the date the work was made available to the public. Some types of works may have a shorter term of protection. “Audiovisual” works, i.e. films, have a minimum term of protection of 50 years from the date of making available, and photographs and practical art (furniture, jewelry, etc.) have a minimum term of protection of 25 years from the date of making available. However, these are only minimum protections, and they may have the same or even longer term of protection as other works.
sv_se: De flesta länder har kommit överens om att ett verk ska ha ett minimiskydd på minst 50 år från det att verkets alla skapare avlidit, vilket brukar beskrivas som ”livet + 50 år”. I många länder gäller ”livet + 70 år”, och en del länder har ”livet + 120 år”. Om allmänheten inte kan avgöra vem verkets skapare är (d.v.s. avgöra om denne lever) så gäller dock ett minimiskydd på 50 år från det att verket gjorts tillgängligt för allmänheten. En del typer av verk kan ha kortare skydd. ”Audiovisuella” verk, d.v.s. filmer, har ett minimiskydd på 50 år från tillgängliggörandet, och fotografier och praktisk konst (möbler, smycken etc.) har ett minimiskydd på 25 år från tillgängliggörandet. Detta är dock bara minimiskydd, och de kan ha lika långt skydd som övriga verk.

# general_copyright_length_question
source: How long does copyright last?
sv_se: Hur länge räcker upphovsrätt?

# general_copyright_symbol_answer
source: No, copyright applies regardless of whether you use the copyright symbol or not, but it is customary to do so anyway, and to write something like “(c)” in cases where you cannot write “©”. It is always best to be clear.
sv_se: Nej, upphovsrätt gäller oavsett huruvida man använder upphovsrättssymbolen eller ej, men det är konvention att göra det ändå, och att skriva t.ex. ”(c)” i de fall där man inte har möjlighet att skriva ”©”. Det är alltid bäst att vara tydlig.

# general_copyright_symbol_question
source: Do I have to use the copyright symbol, ©?
sv_se: Måste man använda upphovsrättssymbolen ©?

# general_copyright_years_answer
source: Copyright in a work applies whether or not you include a copyright notice, and regardless of the particular form of the notice. If you do include a notice, it’s a good idea to include the year. The years are mainly there to help other people tell whether the copyright on the work has expired — and, if it has not, to make it even clearer that the creators are asserting their rights. So if you want to be clear, you can write the year when you first made the work available to the public. For example, if you wrote a novel between 2010 and 2013, put it away for 10 years, and published it in 2023, you would write “Copyright © 2023”. For “living works” — that is, works that change even after they were made available for the first time — you can use multiple years. If you published a web page in 2015 and then did not update it until 2020, you could write “Copyright © 2015, 2020”. On the other hand, if you have updated it each year in between, you could say “Copyright © 2015-2020”. And if you have updated the web page such that no material written before 2018 remains, you can then start writing “Copyright © 2018-2020”. Finally, you can combine the forms: a web page with material written in 2015 and 2018-2020 can have the text “Copyright © 2015, 2018-2020”.
sv_se: Upphovsrätt för ett verk gäller oavsett huruvida man skriver en upphovsrättsnotis eller ej, och oavsett formen för hur man gör det. Om man gör det är det bra att skriva årtal. Årtalen är främst till för att hjälpa andra att beräkna huruvida upphovsrätten har hunnit gå ut för verket – samt att det tydliggör ytterligare att upphovspersonen hävdar sin rätt. Om man vill vara tydlig kan man därför ange årtalet då man för första gången gjorde verket tillgängligt för allmänheten. Om man t.ex. skrev en roman mellan åren 2010-2013, lade undan romanen i 10 år, och publicerade den 2023, så skriver man ”copyright 2023”. För ”levande verk”, alltså verk som förändras även efter att de tillgängliggjorts för första gången, så kan man skriva flera årtal. Om man publicerat en webbsida år 2015 och därefter inte uppdaterat den förrän år 2020 så kan man skriva ”copyright 2015, 2020”. Om man däremot hållit den uppdaterad varje år så kan man skriva ”copyright 2015-2020”. Och om man uppdaterat webbsidan så att inget material finns kvar som skrevs före år 2018 så kan man därefter börja skriva ”copyright 2018-2020”. Slutligen kan man kombinera skrivsätten: en webbsida med material skrivet under åren 2015 och 2018-2020 kan ha texten ”copyright 2015, 2018-2020”.

# general_copyright_years_question
source: How do years work in copyright notices?
sv_se: Hur fungerar årtal i upphovsrättsnotiser?

# general_derivative_works_answer
source: A derivative work is a work created based on someone else’s work, in the broadest sense of the term. Performing someone else’s song creates a derivative work; creating subtitles to someone else’s film creates a derivative work; creating a collage of pictures that includes a detail from someone else’s picture creates a derivative work. In many countries, it is considered a violation of copyright law to create a derivative work without the permission of the original creator, even for private use (e.g., translating a novel even though no one else will ever read the translation). The derivative work itself may cross the threshold of originality and be protected by copyright, whether or not the original work itself is protected by copyright (e.g., a photograph of the Mona Lisa painting). If the original work is copyrighted, the derivative work may have two or more authors, so distribution and use require permission from all of them. However, there are situations in which a derivative work may be considered to have transformed the original work in such a way that its use no longer requires the permission of the original creator, such as in the case of satire or scholarly analysis of the original, but as a general rule the use of the original should be limited in scope.
sv_se: Ett bearbetat verk är ett verk som skapats baserat på någon annans verk, i bred bemärkelse. Framförandet av någon annans låt är ett bearbetat verk; undertexterna till någon annans film är ett bearbetat verk; ett bildkollage som innehåller en detalj ur någon annans bild är ett bearbetat verk. I många länder anses det strida mot upphovsrättslagen att skapa ett bearbetat verk utan originalupphovspersonens tillåtelse, även för rent privat bruk (t.ex. att skapa en romanöversättning som ingen annan människa kommer att läsa). Bearbetningen i sig kan uppnå verkshöjd och skyddas av upphovsrätt, oavsett om originalverket i sig skyddas av upphovsrätt eller ej (t.ex. ett fotografi av målningen Mona Lisa). Om originalet är upphovsrättsskyddat så kan det bearbetade verket ha två eller fler upphovspersoner, så att spridning och användning kräver allas tillåtelse. Det finns dock situationer där ett bearbetat verk anses ha ändrat originalverket på ett sådant sätt att tillåtelse från originalets upphovsperson inte behövs, t.ex. vid satir eller akademisk analys av originalet, men i regel bör användningen av originalet begränsas i omfattning.

# general_derivative_works_question
source: What is a derivative work? What applies to derivative works?
sv_se: Vad är ett bearbetat verk / andrahandsverk (”derivatverk”)? Vad gäller för bearbetade verk?

# general_international_answer
source: It depends on which countries are involved, and what agreements they have with each other, but a rule of thumb might be that if a work is published in another country, you can treat it as if it were published in your own country. What constitutes a copyright infringement therefore depends on where the infringement occurs (a question that can be complicated in the case of infringements that take place over the Internet, for example).
sv_se: Det beror på vilka länder det gäller, och vilka avtal de har med varandra, men en tumregel kan vara att om ett verk publicerats i ett annat land så kan man behandla det som om det publicerats i ens eget land. Vad som utgör ett upphovsrättsbrott beror alltså på var brottet begås (en fråga som kan försvåras vid brott som sker t.ex. över Internet).

# general_international_question
source: How does copyright — and copyright infringement — work internationally?
sv_se: Hur fungerar upphovsrätt och upphovsrättsbrott internationellt?

# general_moral_rights_answer
source: In general, copyright can be said to consist of economic rights and moral rights. Economic rights are the right to control the distribution and use of your work. The economic right to a work can usually be sold so that the author no longer has the right to control its distribution and use. The moral right is primarily the right to be recognized as the author of the work, but also the right to object to (perceived) defamatory treatment of the work. In many countries, moral rights cannot be sold, transferred or waived; they do not expire until the copyright of the work expires.
sv_se: Allmän upphovsrätt kan sägas bestå av förfoganderätt och ideell rätt. Förfoganderätt innebär rätten att kontrollera spridning och användning av sitt verk. Förfoganderätten för ett verk kan i regel säljas, så att upphovspersonen inte längre har någon rätt att kontrollera spridning och användning. Ideell rätt är främst rätten att kräva erkännande som verkets upphovsperson, men också rätten att invända mot (upplevd) ärekränkande behandling av verket. I många länder kan ideell rätt varken säljas, överlåtas, eller avsägas; den upphör i så fall endast när upphovsrätten för verket gör det.

# general_moral_rights_question
source: What are moral rights?
sv_se: Vad är ideell (moralisk) rätt?

# general_publicity_rights_answer
source: It generally refers to the right to control the distribution and use of images, videos, and sound recordings in which you are personally identifiable, especially for commercial use. It is not a right that exists in all countries, but where it does, it is something to be considered separately from copyright.
sv_se: I allmänhet gäller det rätten att kontrollera spridning och användning av bilder, filmer, och ljudupptagningar på vilka man är personligt identifierbar, särskilt kommersiell användning. Det är inte en rätt som existerar i alla länder, men där den gör det är det något att ta hänsyn till separat från upphovsrätt.

# general_publicity_rights_question
source: What is the right of publicity / right of personality / right of privacy?
sv_se: Vad är publicitetsrätt / personlighetsrätt / integritetsrätt?

# general_what_is_originality_answer
source: When a person creates a work, it may cross the threshold of originality, which means that it is legally protected under copyright law. This protection applies as soon as the work crosses the threshold, “as soon as the pen leaves the paper”, without anyone else having to see the work or even be notified that it has been created. What is required for the work to cross the threshold of originality varies depending on where the work is created: in some countries the threshold is very low, while others may require that the work could not reasonably be created by two people independently of each other. In most cases, the work does not have to be “original” in the sense of “innovative” or “non-traditional”; instead, it is sufficient (and required) that the work reflects to some degree the personality of its creator and results from some form of effort. In some countries, it is possible to “register” a work; usually this just means that you have some additional legal options, such as being able to claim higher damages if you sue for infringement, but copyright applies even without registration.
sv_se: När en person skapar ett verk så kan det uppnå verkshöjd, vilket innebär att det är juridiskt skyddat under upphovsrätten. Detta skydd gäller så fort verket uppnår verkshöjd, ”så fort pennan lämnar pappret”, utan att någon annan behöver se verket eller ens meddelas om att det skapats. Vad som krävs för att verket ska uppnå verkshöjd varierar beroende på var verket skapas. I vissa länder är gränsen väldigt låg, medan andra länder kan kräva att verket inte rimligtvis ska kunna skapas av två personer oberoende av varandra. Oftast gäller att verket inte måste vara ”originellt” i bemärkelsen nydanande eller otraditionellt, utan att det räcker (och kräver) att verket i någon mån speglar sin upphovspersons personlighet och uppstår efter någon form av arbetsinsats. I vissa länder kan man ”registrera” ett verk; i regel innebär det bara att man har vissa extra juridiska möjligheter, t.ex. att man kan kräva större skadestånd, men upphovsrätten gäller även utan registrering.

# general_what_is_originality_question
source: What is the “threshold of originality”? When is something protected by copyright?
sv_se: Vad är ”verkshöjd”? När skyddas något av upphovsrätt?

# group_code
source: Source Code
sv_se: Källkod

# group_font
source: Fonts
sv_se: Fontfiler

# group_general
source: General
sv_se: Allmänt
